/*********************************************************************
 * Сделай функцию, которая принимает массив любых целых чисел, которая 
 *  возращает истинну, если все элементы четные, если бы хотя бы один 
 *  элемент не четный, то false.
 *********************************************************************/

const arrayOfEvenNumbers = (array) => {

	for (let item of array) {
		if (item % 2 != 0) {
			return false;
		}
	}
	return true
}


arr1 = [2, 4, 6, 8, 10, 12, 14, 16];
arr2 = [2, 4, 6, 8, 9, 12, 14, 16];

console.log(arrayOfEvenNumbers(arr1));
console.log(arrayOfEvenNumbers(arr2));

