/*****************************************************************
 * Сделай функцию, которая принимает массив любых целых чисел,
 * которая возращает новый массив, где все элементы кратны пяти.
 *  ([1,2,5,12,15,21] вернет [5,15])
 *****************************************************************/

const arr1 = [1, 2, 5, 12, 15, 21];
const arr2 = [100, 10, 5, 40, 15, 25];
const arr3 = [3, 6, 7, 8, 88, 41];

const arrayFilter = (array) => {

	return newArr = array.filter(item => item % 5 == 0)
}

console.log(arrayFilter(arr1))
console.log(arrayFilter(arr2))
console.log(arrayFilter(arr3))
