/******************************************************************************************
* Завершите метод/функцию так, чтобы она преобразовала слова, разделенные тире/подчеркиванием,
* в camelcasing. Первое слово в выходных данных должно быть заглавным, 
* только если исходное слово было заглавным 
* П Р И М Е Р:
* "the-stealth-warrior" gets converted to "theStealthWarrior"
* "The_Stealth_Warrior" gets converted to "TheStealthWarrior"
*******************************************************************************************/
