# Написать функцию, которая принимает два числа
# и возращает результат их умножения

NUMBER = 10

print(NUMBER)

if NUMBER == 10:
    print("Ура")
