# Написать функцию, которая принимает два числа
# и возращает результат их умножения

first_number, second_number = int(input('Число 1: ')), int(input('Число 2: '))
print(first_number * second_number)
